In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("data/titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [7]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [8]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [11]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

In [12]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [13]:
model.fit(X_train,y_train)

GaussianNB()

In [14]:
model.score(X_test,y_test)

0.7798507462686567

In [15]:
X_test[0:10]

     Pclass        Age      Fare  female
203       3  45.500000    7.2250       0
390       1  36.000000  120.0000       0
40        3  40.000000    9.4750       1
479       3   2.000000   12.2875       1
724       1  27.000000   53.1000       0
795       2  39.000000   13.0000       0
88        1  23.000000  263.0000       1
26        3  29.699118    7.2250       0
328       3  31.000000   20.5250       1
754       2  48.000000   65.0000       1

In [16]:
y_test[0:10]

203    0
390    1
40     0
479    1
724    1
795    0
88     1
26     0
328    1
754    1
Name: Survived, dtype: int64

In [17]:
model.predict(X_test[0:10])

array([0, 1, 1, 1, 0, 0, 1, 0, 1, 1])

In [18]:
model.predict_proba(X_test[:10])

array([[9.71667882e-01, 2.83321181e-02],
       [2.67637065e-02, 9.73236294e-01],
       [4.70439087e-01, 5.29560913e-01],
       [2.33253351e-01, 7.66746649e-01],
       [6.56307895e-01, 3.43692105e-01],
       [9.40311913e-01, 5.96880872e-02],
       [5.90205702e-14, 1.00000000e+00],
       [9.71931862e-01, 2.80681376e-02],
       [4.65258793e-01, 5.34741207e-01],
       [1.02390535e-01, 8.97609465e-01]])

In [19]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(),X_train, y_train, cv=5)

array([0.808     , 0.784     , 0.72      , 0.7983871 , 0.71774194])